In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data.tolist()

[1, 2, 3, 4, 5]

In [5]:
a = pd.Series([1,2,3,4])
b = pd.Series([5,6,7,8])
print(a+b)
print(a-b)
print(a*b)
print(a/b)

0     6
1     8
2    10
3    12
dtype: int64
0   -4
1   -4
2   -4
3   -4
dtype: int64
0     5
1    12
2    21
3    32
dtype: int64
0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

In [11]:
arr = pd.Series(['apple','ball','cat'])
print(arr.str.upper())
print(arr.str.lower())
print(arr.str.len())

0    APPLE
1     BALL
2      CAT
dtype: object
0    apple
1     ball
2      cat
dtype: object
0    5
1    4
2    3
dtype: int64

In [13]:
arr = pd.Index(['   apple   ','  ball  ',' cat  '])
arr.str.strip()

Index(['apple', 'ball', 'cat'], dtype='object')

In [42]:
data = {'Name':['Shoheb','Ali','Akram'],'Father':['Karimulla','Shabbeer','Karimulla'],'No.':[123,786,420]}
label = ['y20cs167','y20cs164','y20cs162']

df=pd.DataFrame(data,index=label)
print(df)

            Name     Father  No.
y20cs167  Shoheb  Karimulla  123
y20cs164     Ali   Shabbeer  786
y20cs162   Akram  Karimulla  420

In [28]:
df['Name']['y20cs167']

'Akram'

In [35]:
df.columns.values

array(['Name', 'Father', 'No.'], dtype=object)

In [41]:
df['Name'] = df['Name'].replace('Ali','Uday')
df

            Name     Father  No.
y20cs167  Shoheb  Karimulla  123
y20cs164    Uday   Shabbeer  786
y20cs162   Akram  Karimulla  420

In [43]:
df['Grade'] = [9.4,9.5,9.2]
df

            Name     Father  No.  Grade
y20cs167  Shoheb  Karimulla  123    9.4
y20cs164     Ali   Shabbeer  786    9.5
y20cs162   Akram  Karimulla  420    9.2

In [49]:
data = {'Name':['Shoheb','Ali','Akram'],'Father':['Karimulla','Shabbeer','Karimulla'],'No.':[123,786,420]}
label = ['y20cs167','y20cs164','y20cs162']

df=pd.DataFrame(data,index=label)
print(df)

            Name     Father  No.
y20cs167  Shoheb  Karimulla  123
y20cs164     Ali   Shabbeer  786
y20cs162   Akram  Karimulla  420